{
  "entry": {
    "signInTitle": "Sign In",
    "signUpTitle": "Sign Up",
    "enterName": "Enter your name",
    "name": "Name",
    "enterPhone": "Enter your phone number",
    "phone": "Phone",
    "createPassword": "Create a password",
    "enterPassword": "Enter password",
    "password": "Password",
    "passwordHint": "* From 8 to 15 characters without spaces, Latin letters, digits, at least one letter and one digit",
    "agreeText": "I agree with",
    "privacyPolicy": "Privacy Policy",
    "forgotPassword": "Forgot password?",
    "signInButton": "Sign In",
    "signUpButton": "Sign Up",
    "notRegistered": "Not registered yet?",
    "alreadyRegistered": "Already registered?"
  },
  "validation": {
    "required": "This field is required",
    "length": "Must be between 2 and 30 characters",
    "phone": "Please check the phone number format",
    "password": "8-15 characters, Latin letters, digits, at least one letter and one digit, no spaces",
    "name": "2 to 30 characters, allowed letters, digits, and symbols: . ’ ` - _",
    "pin": "Must be 4 digits without spaces"
  },
  "resetPassword": {
    "title": "Password Reset",
    "newPasswordText": "Create a new password to log in",
    "phoneText": "Enter your phone number and we’ll send an SMS to reset your password",
    "codeText": "Enter the code we sent you in the message to reset your password"
  },
  "home": {
    "helpTitle": "If you’re overwhelmed by emotions",
    "dailyChallenges": "Daily Challenges",
    "quote_of_the_day": "Quote of the Day",
    "quote_loading": "Loading quote...",
    "quote_error": "Error loading quote"
  },
  "moodTracker": {
    "title": "Mood Tracker",
    "howAreYou": "How are you feeling today?",
    "shareWithMe": "Share with me",
    "statistics": "Statistics",
    "lastUpdate": "Last update:",
    "loading": "Loading...",
    "error": "Failed to load data."
  },
  "month": {
    "january": "January",
    "february": "February",
    "march": "March",
    "april":"April",
    "may": "May",
    "june": "June",
    "july": "July",
    "august": "August",
    "september": "September",
    "october": "October",
    "november": "November",
    "december": "December"
  },
  "chest": "Chest",
  "techniques": "Techniques",
  "diary": "Diary",
  "no_favorite_techniques": "No favorite techniques",
  "no_favorite_entries": "No favorite entries",
  "not_found_entry": "Entry not found",
  "instructions_title": "Chest - Instructions",
  "diaryPage": {
    "title": "Diary",
    "add_note": "Add Record",
    "note_exists": "A record for today has already been created. Keep it up!",
    "tab_notes": "Notes",
    "tab_tracker": "Tracker",
    "tab_challenges": "Challenges",
    "guide_title": "Diary - write down your thoughts and feelings every day, it will help you track your progress",
    "open_all": "open all",
    "placeholder": "There is no text yet",
    "save": "Save",
    "title_placeholder": "Title",
    "what_happened_today": "What happened today?",
    "how_are_you": "How are you?",
    "my_condition": "My condition:",
    "delete_note_confirm": "Are you sure you want to delete this note?",
    "delete_account_confirm": "Are you sure you want to delete your account?",
    "recover_note_hint": "(Can be restored within 6 months)"
  },
  "curiosities": {
    "title": "Curiosities",
    "modalTitle": "Curiosities – a section for engaging stories and comics",
    "comics": "Comics",
    "stories": "Stories",
    "comicsListEmpty": "The list of comics is empty."
  },
  "help": {
    "subtitlePart1": "Let's start with stabilization techniques,",
    "subtitlePart2": "we will manage!",
    "question": "Are you feeling better now?",
    "yes": "Yes",
    "no": "No! Another exercise",
    "restart": "No, start over",
    "call": "Call the support line"
  },
  "selectMood": {
    "title1": "How do you",
    "title2": "feel?",
    "iFeel": "I feel:",
    "why": "Why do I feel this way?",
    "save": "Save",
    "understood": "Understood"
  },
  "additionalMoods": {
    "shame": "shame",
    "disgust": "disgust",
    "tension": "tension",
    "confusion": "confusion",
    "sadness": "sadness",
    "fatigue": "fatigue",
    "fear": "Страх",
    "anger": "Злість",
    "loneliness": "Самотність",
    "guilt": "Провина",
    "worry": "Хвилювання",
    "hope": "Надія",
    "pleasure": "Задоволення",
    "gratitude": "Вдячність",
    "calmness": "Спокій",
    "surprise": "Здивування",
    "joy": "Радість",
    "happiness": "Щастя"
  },
  "profile": {
    "myCabinet": "My Cabinet",
    "challenges": "Challenges",
    "fashion": "Kapi Fashion",
    "settings": "Settings",
    "privacy": "Privacy Policy",
    "logout": "Log Out",
    "phone": "Tel. +"
  },
  "avatar": {
    "takePhoto": "Take photo",
    "uploadFromGallery": "Upload from gallery",
    "delete": "Delete",
    "save": "Save",
    "saving": "Saving...",
    "cameraGalleryAccessError": "Camera and gallery access is required",
    "cameraAccessError": "Camera access is required",
    "invalidFormat": "Invalid file format. Supported formats: jpg, jpeg, png, heif.",
    "fileTooLarge": "Image size is too large",
    "imageUrlError": "Failed to get image URL",
    "uploadError": "Error occurred while uploading image",
    "unknownError": "Unknown error",
    "updateError": "Failed to update avatar",
    "imageLoadError": "Unable to load image"
  },
  "new": "New",
  "inProgress": "In progress",
  "completed": "Completed",
  "storePage": {
    "title":"Capi Fashion",
    "storeGiftPageTitle": "Gift",
    "balanceLabel": "Balance:",
    "tabAll": "All",
    "tabBought": "Purchased",
    "buy_question": "Do you want to buy?",
    "yes": "Yes",
    "no": "No",
    "not_enough_coins": "Not enough coins"
  },
  "settings": {
    "title": "Settings",
    "privacy": "Privacy",
    "password": "Login password",
    "notifications": "Notifications",
    "mood_tracker": "Mood tracker",
    "challenge_notifications": "Challenge notifications",
    "delete_account": "Delete account",
    "notification_permission_error": "Please allow notifications in your phone settings."
  },
  "contact_info": {
    "title_with_balance": "Contact Information",
    "title": "Contact Info",
    "name": "Name",
    "phone": "Phone",
    "balance": "Balance",
    "save": "Save",
    "name_label": "Name:",
    "name_placeholder": "Name",
    "phone_placeholder": "Your phone"
  },
  "reset_password": {
    "title": "Privacy",
    "new_password_text": "Create a new login password",
    "login_password": "Login password",
    "change": "Change",
    "save": "Save"
  },
  "step_new_password": {
    "button": "Next",
    "new_password_label": "New password",
    "new_password_placeholder": "Password",
    "confirm_password_label": "Repeat password",
    "confirm_password_placeholder": "Password",
    "password_mismatch": "Passwords do not match"
  },
  "privacyPage": {
    "title": "Privacy Policy",
    "title1": "Definitions and Key Terms",
    "title2": "What Information Do We Collect?",
    "title3": "How Do We Use the Information We Collect?",
    "title4": "When Does iStrong Use End User Information from Third Parties?",
    "title5": "Do We Share the Information We Collect with Third Parties?",
    "title6": "Where and When Is Information Collected from End Users?",
    "title7": "How Do We Use Your Email Address?",
    "title8": "How Long Do We Keep Your Information?",
    "title9": "How Do We Protect Your Information?",
    "title10": "Can My Information Be Transferred to Other Countries?",
    "title11": "Is the Information Collected Through the iStrong Service Secure?",
    "title12": "Can I Update or Correct My Information?",
    "title13": "Governing Law",
    "title14": "Links to Other Websites",
    "title15": "Advertising",
    "btn": "Got it",
    "text1": "iStrong, represented by the Public Union \"Association of Mentoring for Children and Youth,\" EDRPOU code 42387194 (\"we,\" \"our,\" or \"us\"), is committed to protecting your privacy. This Privacy Policy explains how your personal information is collected, used, and disclosed by iStrong. This Privacy Policy applies to our application and its related subdomains (collectively, the \"Service\"). By accessing or using our Service, you acknowledge that you have read, understood, and agree to the collection, storage, use, and disclosure of your personal information as described in this Privacy Policy and our Terms of Service.",
    "text2": "To explain things as clearly as possible in this Privacy Policy, every time any of the following terms are mentioned, they are strictly defined as follows:\n\nCompany: When this policy mentions “Company,” “we,” “us,” or “our,” it refers to the Public Union \"Association of Mentoring for Children and Youth,\" EDRPOU code 42387194, Kyiv, Ukraine, which is responsible for your information under this Privacy Policy.\n\nCountry: Where iStrong or the owners/founders of iStrong are located—in this case, Ukraine.\n\nDevice: Any internet-connected device such as a phone, tablet, computer, or any other device that can be used to visit iStrong and use the services.\n\nIP Address: Every device connected to the Internet is assigned a number known as an Internet Protocol (IP) address. These numbers are typically assigned in geographic blocks. An IP address can often be used to identify the location from which a device is connecting to the Internet.\n\nPersonnel: Refers to those individuals who are employed by iStrong or are under contract to provide a service on behalf of one of the parties.\n\nPersonal Data: Any information that directly, indirectly, or in connection with other information — including a personal identification number — allows for the identification of a natural person.\n\nService/Application: Refers to the service provided by iStrong as described in the relevant terms (if available) and on this platform.\n\nServices: A set of informational and consulting services provided online by iStrong in accordance with the procedure and under the terms specified in the End User Agreement. The services are not medical services and are intended for informational and consulting purposes only.\n\nThird-Party Services: Refers to advertisers, contest sponsors, promotional and marketing partners, and others who provide our content or whose products or services we believe may interest you.\n\nYou/End User: A natural person who is registered with iStrong to use the Services.",
    "text3": "We collect information from you when you visit our application, register in our app, subscribe to our newsletter, respond to a survey, participate in challenges, or fill out a journal. We collect the following information:\n\nName\n\nPhone number\n\nOptional personal photo\n\nEmail address\n\nGeolocation\n\nIP address\n\nDevice type\n\nPersonal notes you share while using the app\n\nHistory of your communication with iStrong personnel using manual data capture technologies, including stenography and any memory or recording devices.\n\nWe also collect information from mobile devices to enhance user interaction, although these features are entirely optional.",
    "text4": "Any information we collect from you may be used in one of the following ways:\n\nTo transfer information to Professionals who provide their services through the app, always in accordance with confidentiality criteria.\n\nTo provide or transfer information to unrelated third parties in the following cases:\n 2.1. At your request;\n2.2. To comply with a legal obligation or a request from a government agency or court;\n2.3. To investigate a possible crime, such as identity theft.",
    "text5": "iStrong will collect end-user data necessary to provide iStrong services. End users may voluntarily provide us with information they have posted on social networking websites. If you provide us with such information, we may collect publicly available information from the social networking websites you specify. You can control how much of your information social networking websites disclose by visiting those websites and adjusting your privacy settings.",
    "text6": "We may share the information we collect, both personal and non-personal, with third parties such as advertisers, contest sponsors, promotional and marketing partners, and others whose products or services we believe may be of interest to you. We may also share it with our current and future affiliated companies and business partners. In the event of a merger, sale of assets, or other business reorganization, we may also share or transfer your personal and non-personal information to our successors.\n\nWe may engage trusted third-party service providers to perform functions and provide services for us, such as hosting and maintaining our servers and app, database storage and management, email management, and marketing storage. We are likely to share your personal information and possibly some non-personal information with these third parties so that they can provide these services to us and to you.\n\nWe may share parts of our log data, including IP addresses, for analytics purposes with third parties such as web analytics partners, app developers, and ad networks. If your IP address is shared, it may be used to estimate general location and other technical data such as connection speed, whether you have visited the app in a shared location, and the type of device used to access the app. They may collect information about what you view in the app and then provide auditing, research, and reporting for us and our advertisers.\n\nWe may also disclose personal and non-personal information about you to government or law enforcement officials or private parties if, in our sole discretion, we believe it is necessary or appropriate to respond to claims, legal processes (including subpoenas), to protect our rights and interests or those of a third party, public or individual safety, to prevent or stop any illegal, unethical, or legally actionable activity, or to otherwise comply with applicable court orders, laws, rules, and regulations.",
    "text7": "iStrong will collect the personal information that you send to us. We may also receive personal information about you from third parties, as described above.",
    "text8": "By submitting your email address in this application, you agree to receive emails from us. You may unsubscribe from any of these mailing lists at any time by clicking the unsubscribe link or other opt-out option included in the relevant email. We send emails only to people who have authorized us to contact them either directly or through a third party. We do not send unsolicited commercial emails, because we hate spam just as much as you do.\n\nBy submitting your email address, you also agree to its use for customer audience targeting on platforms such as Facebook, where we display custom advertising to specific individuals who have agreed to receive communications from us.\n\nEmail addresses submitted solely on the order processing page will be used exclusively for the purpose of sending you information and updates related to your order. However, if you have provided us with the same email address through another method, we may use it for any of the purposes stated in this Policy.\n\nNote: If at any time you wish to unsubscribe from receiving future emails, we include detailed unsubscribe instructions at the bottom of each email.",
    "text9": "We retain your information only for as long as it is needed to provide you with iStrong and to fulfill the purposes described in this policy. This also applies to anyone with whom we share your information and who provides services on our behalf. When we no longer need to use your information and no longer need to retain it to comply with our legal or regulatory obligations, we will either remove it from our systems or anonymize it so that you can no longer be identified.\n\nYour information will be stored for six months after you stop using the application.",
    "text10": "We implement a variety of security measures to ensure the safety of your personal information when you use our application. However, we cannot guarantee the absolute security of any information you transmit to iStrong, nor can we guarantee that your information on the Service will not be accessed, disclosed, altered, or destroyed as a result of a breach of any of our physical, technical, or managerial safeguards.",
    "text11": "iStrong is registered in Ukraine. Information collected through our application, through direct interaction with you, or as a result of using our support services, may from time to time be transferred to third parties located around the world, and may be viewed and hosted anywhere in the world, including in countries that may not have broadly applicable laws governing the use and transfer of such data. To the fullest extent permitted by applicable law, by using any of the above, you voluntarily consent to the cross-border transfer and hosting of such information.",
    "text12": "We take measures to protect your information. We have physical, electronic, and managerial procedures in place to help safeguard, prevent unauthorized access, maintain data security, and properly use your information. However, neither people nor security systems are infallible, including encryption systems. In addition, individuals may commit intentional crimes, make mistakes, or fail to comply with policies. Therefore, while we make reasonable efforts to protect your personal information, we cannot guarantee its absolute security. If applicable law imposes a non-waivable duty to protect your personal information, you agree that intentional misconduct will be the standard used to measure our compliance with that duty.",
    "text13": "Your rights to request updates or corrections to the information that iStrong collects depend on your relationship with iStrong. Employees may update or correct their information as outlined in our company’s internal employment policies. You have the right to request restrictions on certain uses and disclosures of your personal information as described below. You may contact us to (1) update or correct your personal information, (2) change your preferences regarding messages and other information you receive from us, or (3) delete the personal information stored about you in our system (subject to the next paragraph) by canceling your account. Such updates, corrections, changes, and deletions will not affect other information we maintain or information we have provided to third parties in accordance with this Privacy Policy prior to such update, correction, change, or deletion.\n\nTo protect your privacy and security, we may take reasonable steps (such as requesting a unique password) to verify your identity before granting you access to your profile or making corrections. You are responsible for maintaining the secrecy of your unique password and account information at all times.\n\nYou should be aware that it is not technologically possible to remove every record of the information you have provided to us from our systems. The need to back up our systems to protect information from accidental loss means that a copy of your information may exist in a non-erasable form that will be difficult or impossible for us to locate. Upon receiving your request, all personal information stored in databases we actively use and other searchable media will be updated, corrected, changed, or deleted as soon as reasonably and technically practicable, based on the circumstances and to the extent reasonably and technically possible.\n\nIf you are an end user and wish to update, delete, or obtain any information we have about you, you may do so by contacting iStrong support.",
    "text14": "This Privacy Policy is governed by the laws of Ukraine, without regard to conflict of law principles. You agree to the exclusive jurisdiction of the courts in connection with any actions or disputes arising between the parties under or relating to this Privacy Policy. The laws of Ukraine, excluding its conflict of law rules, govern this Agreement and your use of the application. Your use of the application may also be subject to other local, state, national, or international laws.\n\nYou acknowledge that you agree to the Privacy Policy and the End User Agreement by checking the appropriate box during registration in the iStrong application. If you do not agree with this Privacy Policy, you should not use our application. Continued use of the application, direct interaction with us, or the posting of changes to this Privacy Policy that do not materially affect the use or disclosure of your personal information will indicate your acceptance of those changes.",
    "text15": "This Privacy Policy applies only to the use of our application, iStrong. The application may contain links to other websites not controlled by iStrong. We are not responsible for the content, accuracy, or opinions expressed on such websites, and those websites are not reviewed, monitored, or verified for accuracy or completeness.\n\nPlease remember that when you use links to leave the Services and visit another website, our Privacy Policy no longer applies. Your browsing and interaction on any other website, including those linked from our platform, are governed by the rules and policies of that website. Such third parties may use their own cookies or other methods to collect information about you.",
    "text16": "This application may contain third-party advertisements and links to third-party websites. iStrong makes no representations regarding the accuracy or suitability of any information contained in these advertisements or on these websites and assumes no responsibility for the behavior or content of these advertisements and websites, as well as offers made by third parties.\n\nThird-party advertisements and links to other sites advertising goods or services do not constitute endorsement or recommendation by iStrong of those sites, goods, or services. iStrong is not responsible for the content of any advertisements, any promises made, or the quality/reliability of products or services offered in all advertisements."
  },
  "noInternet": "No internet connection.",
  "connectionRestored": "Connection restored!",
  "shame": "Shame",
  "disgust": "Disgust",
  "tension": "Tension",
  "perplexity": "Perplexity",
  "sadness": "Sadness",
  "fatigue": "Fatigue",
  "fear": "Fear",
  "malice": "Malice",
  "solitude": "Solitude",
  "fault": "Fault",
  "concern": "Concern",
  "hope": "Hope",
  "pleasure": "Pleasure",
  "appreciation": "Appreciation",
  "rest": "Rest",
  "surprise": "Surprise",
  "joy": "Joy",
  "happiness": "Happiness"

}
