{
  "entry": {
    "signInTitle": "Вхід",
    "signUpTitle": "Реєстрація",
    "enterName": "Введи своє ім’я",
    "name": "Ім’я",
    "enterPhone": "Введи номер телефону",
    "phone": "Телефон",
    "createPassword": "Придумай пароль",
    "enterPassword": "Введи пароль",
    "password": "Пароль",
    "passwordHint": "* Від 8 до 15 символів без пробілів, латинські літери, цифри, щонайменше одна літера і одна цифра",
    "agreeText": "Я погоджуюсь з",
    "privacyPolicy": "Політикою Конфіденційності",
    "forgotPassword": "Забув(-ла) пароль?",
    "signInButton": "Увійти",
    "signUpButton": "Зареєструватися",
    "notRegistered": "Ще не зареєстрований(-а)?",
    "alreadyRegistered": "Вже зареєстрований(-на)?"
  },
  "validation": {
    "required": "Обов’язкове поле",
    "length": "Від 2 до 30 символів",
    "phone": "Переконайся у правильності введеного номеру",
    "password": "Від 8 до 15 символів без пробілів, латинські літери, цифри, щонайменше одна літера і одна цифра",
    "name": "Від 2 до 30 символів, допустимі літери, цифри та символи: . ’ ` - _",
    "pin": "Має бути 4 цифри без пробілів"
  },
  "resetPassword": {
    "title": "Зміна пароля",
    "newPasswordText": "Придумай новий пароль для входу",
    "phoneText": "Вкажи свій номер телефону і на нього прийде SMS-повідомлення для створення нового пароля",
    "codeText": "Введи код, який ми надіслали тобі у повідомлення для зміни пароля"
  },
  "home": {
    "helpTitle": "Якщо тебе накривають емоції",
    "dailyChallenges": "Щоденні челенджі",
    "quote_of_the_day": "Цитата дня",
    "quote_loading": "Завантаження цитати...",
    "quote_error": "Помилка завантаження"
  },
  "moodTracker": {
    "title": "Трекер настрою",
    "howAreYou": "Як твій настрій сьогодні?",
    "shareWithMe": "Поділись зі мною",
    "statistics": "Статистика",
    "lastUpdate": "Останнє оновлення:",
    "loading": "Завантаження...",
    "error": "Помилка завантаження даних.",
    "today": "Сьогодні"
  },
  "month": {
    "january": "січня",
    "february": "лютого",
    "march": "березня",
    "april":"квітня",
    "may": "травня",
    "june": "червня",
    "july": "липня",
    "august": "серпня",
    "september": "вересня",
    "october": "жовтня",
    "november": "листопада",
    "december": "грудня"
  },
  "chest": "Скарбничка",
  "techniques": "Техніки",
  "diary": "Щоденник",
  "no_favorite_techniques": "Немає вибраних технік",
  "no_favorite_entries": "Немає вибраних записів",
  "not_found_entry": "Запис не знайдено",
  "instructions_title": "Скарбничка - інструкції",
  "diaryPage": {
    "title": "Щоденник",
    "add_note": "Додати запис",
    "note_exists": "Запис про сьогоднішній день вже створено. Так тримати!",
    "tab_notes": "Нотатки",
    "tab_tracker": "Трекер",
    "tab_challenges": "Челенджі",
    "open_all": "відкрити все",
    "placeholder": "Тут ще немає тексту",
    "save": "Зберегти",
    "title_placeholder": "Заголовок",
    "what_happened_today": "Що сталося сьогодні?",
    "how_are_you": "Як ти?",
    "my_condition": "Мій стан:",
    "delete_note_confirm": "Ти впевнений(-а) що хочеш видалити цей запис?",
    "delete_account_confirm": "Ти впевнений(-а), що хочеш видалити аккаунт?",
    "recover_note_hint": "(Можна відновити протягом 6 місяців)"
  },
  "curiosities": {
    "title": "Цікавинки",
    "modalTitle": "Цікавинки - розділ для цікавих історій та коміксів",
    "comics": "Комікси",
    "stories": "Історії",
    "comicsListEmpty": "Список коміксів порожній."
  },
  "help": {
    "subtitlePart1": "Давай почнемо із стабілізаційних технік,",
    "subtitlePart2": "ми впораємось!",
    "question": "Тобі краще тепер?",
    "yes": "Так",
    "no": "Ні! Інша вправа",
    "restart": "Ні, почати спочатку",
    "call": "Подзвонити на лінію пітримки"
  },
  "selectMood": {
    "title1": "Як ти себе",
    "title2": "почуваєш?",
    "iFeel": "Я відчуваю:",
    "why": "Чому я так почуваюсь?",
    "save": "Зберегти",
    "understood": "Зрозуміло"
  },
  "additionalMoods": {
    "shame": "Сором",
    "disgust": "Відраза",
    "tension": "Напруження",
    "confusion": "Розгубленість",
    "sadness": "Сум",
    "fatigue": "Втома",
    "fear": "Страх",
    "anger": "Злість",
    "loneliness": "Самотність",
    "guilt": "Провина",
    "worry": "Хвилювання",
    "hope": "Надія",
    "pleasure": "Задоволення",
    "gratitude": "Вдячність",
    "calmness": "Спокій",
    "surprise": "Здивування",
    "joy": "Радість",
    "happiness": "Щастя"
  },
  "profile": {
    "myCabinet": "Мій кабінет",
    "challenges": "Челенджі",
    "fashion": "Капі Fashion",
    "settings": "Налаштування",
    "privacy": "Політика конфіденційності",
    "logout": "Вийти",
    "phone": "Тел. +"
  },
  "avatar": {
    "takePhoto": "Зробити фото",
    "uploadFromGallery": "Завантажити з галереї",
    "delete": "Видалити",
    "save": "Зберегти",
    "saving": "Збереження...",
    "cameraGalleryAccessError": "Необхідно надати доступ до камери та галереї",
    "cameraAccessError": "Необхідно надати доступ до камери",
    "invalidFormat": "Неприпустимий формат файлу. Формати, що підтримуються: jpg, jpeg, png, heif.",
    "fileTooLarge": "Завеликий розмір зображення",
    "imageUrlError": "Не вдалося отримати URL зображення",
    "uploadError": "Виникла помилка при завантаженні зображення",
    "unknownError": "Невідома помилка",
    "updateError": "Не вдалося оновити аватар",
    "imageLoadError": "Неможливо завантажити зображення"
  },
  "new": "Нові",
  "inProgress": "В процесі",
  "completed": "Завершені",
  "storePage": {
    "title":"Капі Fashion",
    "storeGiftPageTitle": "Подарунок",
    "balanceLabel": "Баланс:",
    "tabAll": "Усі",
    "tabBought": "Придбані",
    "buy_question": "Купуємо?",
    "yes": "Так",
    "no": "Ні",
    "not_enough_coins": "Недостатньо монеток"
  },
  "settings": {
    "title": "Налаштування",
    "privacy": "Конфіденційність",
    "password": "Пароль для входу",
    "notifications": "Сповіщення",
    "mood_tracker": "Трекер настрою",
    "challenge_notifications": "Сповіщення про челенджі",
    "delete_account": "Видалити аккаунт",
    "notification_permission_error": "Будь ласка, дайте дозвіл на отримання сповіщень у налаштуваннях телефону."
  },
  "contact_info": {
    "title_with_balance": "Контактні данні",
    "title": "Контакта інформація",
    "name": "Ім’я",
    "phone": "Телефон",
    "balance": "Баланс",
    "save": "Зберегти",
    "name_label": "Ім’я:",
    "name_placeholder": "Ім’я",
    "phone_placeholder": "Ваш телефон"
  },
  "reset_password": {
    "title": "Конфіденційність",
    "new_password_text": "Придумай новий пароль для входу",
    "login_password": "Пароль для входу",
    "change": "Змінити",
    "save": "Зберегти"
  },
  "step_new_password": {
    "button": "Далі",
    "new_password_label": "Новий пароль",
    "new_password_placeholder": "Пароль",
    "confirm_password_label": "Повтори пароль",
    "confirm_password_placeholder": "Пароль",
    "password_mismatch": "Пароль не збігається"
  },
  "privacyPage": {
    "title": "Політика конфіденційності",
    "title1": "Визначення та ключові терміни",
    "title2": "Яку інформацію ми збираємо?",
    "title3": "Як ми використовуємо інформацію, яку збираємо?",
    "title4": "Коли iStrong використовує інформацію кінцевого користувача від третіх сторін?",
    "title5": "Чи передаємо ми зібрану інформацію третім особам?",
    "title6": "Де і коли збирається інформація від кінцевих користувачів?",
    "title7": "Як ми використовуємо Вашу електронну адресу?",
    "title8": "Як довго ми зберігаємо Вашу інформацію?",
    "title9": "Як ми захищаємо Вашу інформацію?",
    "title10": "Чи може моя інформація бути передана в інші країни?",
    "title11": "Чи захищена інформація, зібрана через службу iStrong?",
    "title12": "Чи можу я оновити або виправити свою інформацію?",
    "title13": "Право, що регулює",
    "title14": "Посилання на інші вебсайти",
    "title15": "Реклама",
    "btn": "Зрозуміло",
    "text1": "iStrong в особі Громадської спілки «Асоціація наставництва для дітей та молоді», код ЄДРПОУ\n        42387194 («ми», «наш» або «нас») прагне захищати Вашу конфіденційність. У цій Політиці\n        конфіденційності пояснюється, як Ваша особиста інформація збирається, використовується та\n        розкривається iStrong. Ця Політика конфіденційності застосовується до нашого додатка та\n        пов’язаних із ним субдоменів (разом – «Сервіс»). Отримуючи доступ або використовуючи наш\n        Сервіс, Ви підтверджуєте, що прочитали, зрозуміли та погоджуєтеся на збір, зберігання,\n        використання та розкриття Вашої особистої інформації, як описано в цій Політиці\n        конфіденційності та наших Умовах обслуговування.",
    "text2": "Щоб якомога зрозуміліше пояснити речі в цій Політиці конфіденційності, кожен раз, коли\n        згадується будь-який із цих термінів, вони суворо визначаються як: Компанія: коли в цій\n        політиці згадується «Компанія», «ми», «нас» або «наш», це стосується Громадської спілки\n        «Асоціація наставництва для дітей та молоді», код ЄДРПОУ 42387194, Київ, Україна, яка\n        відповідає за вашу інформацію відповідно до цієї Політики конфіденційності. Країна: де\n        розташовані iStrong або власники/засновники iStrong, у цьому випадку це Україна. Пристрій:\n        будь-який пристрій, підключений до Інтернету, наприклад телефон, планшет, комп’ютер або\n        будь-який інший пристрій, який можна використовувати для відвідування iStrong і використання\n        послуг. IP-адреса: кожному пристрою, підключеному до Інтернету, присвоюється номер, відомий\n        як адреса Інтернет-протоколу (IP). Ці номери зазвичай призначаються географічними блоками.\n        IP-адресу часто можна використовувати для визначення місця, з якого пристрій підключається\n        до Інтернету. Персонал: відноситься до тих осіб, які працюють у iStrong або мають контракт\n        для надання послуг від імені однієї зі сторін. Персональні дані: будь-яка інформація, яка\n        прямо, опосередковано або у зв’язку з іншою інформацією, включаючи персональний\n        ідентифікаційний номер, дозволяє ідентифікувати фізичну особу. Сервіс/додаток: належать до\n        сервісу, який надає iStrong, як описано у відповідних умовах (якщо доступно) і на цій\n        платформі. Послуги: набір інформаційно-консультаційних послуг, що надаються iStrong онлайн в\n        порядку та на умовах, визначених Договором із кінцевим користувачем. Послуги не є медичними\n        послугами, носять інформаційний та консультаційний характер. Послуги третіх сторін:\n        стосуються рекламодавців, спонсорів конкурсів, рекламних і маркетингових партнерів та інших\n        осіб, які надають наш вміст або чиї продукти чи послуги, на нашу думку, можуть Вас\n        зацікавити. Ви/Кінцевий користувач: фізична особа, яка зареєстрована в iStrong для\n        використання Послуг.",
    "text3": "Ми збираємо інформацію від Вас, коли Ви відвідуєте наш додаток, реєструєтесь у нашому\n        застосунку, підписуєтесь на нашу розсилку, відповідаєте на опитування, берете участь у\n        челенджах або заповнюєте щоденник. Ми збираємо наступну інформацію: ім’я; номер телефону; за\n        бажанням, особисте фото; електронну пошту; геолокацію; IP-адресу; тип пристрою; особисті\n        нотатки, котрими Ви будете ділитися впродовж користування додатком; історія Вашого\n        спілкування з персоналом iStrong з використанням технологій ручного фіксування даних, в тому\n        числі стенографії та будь-яких запам’ятовувальних або реєстраційних пристроїв. Ми також\n        збираємо інформацію з мобільних пристроїв для кращої взаємодії з користувачем, хоча ці\n        функції абсолютно необов’язкові:",
    "text4": "Будь-яка інформація, яку ми збираємо від Вас, може бути використана одним із таких способів:\n        1. передача інформації Професіоналам, які надають свої послуги через додаток, завжди\n        дотримуючись критеріїв конфіденційності; 2. надання або передача інформації непов’язаним\n        третім особам у випадках: 2.1 Вашої вимоги; 2.2.для виконання юридичного зобов’язання або\n        вимоги державної установи чи суду; 2.3. для розслідування можливого злочину, наприклад\n        крадіжки особистих даних.",
    "text5": "iStrong збиратиме дані кінцевого користувача, необхідні для надання послуг iStrong. Кінцеві\n        користувачі можуть добровільно надавати нам інформацію, яку вони опублікували на вебсайтах\n        соціальних мереж. Якщо Ви надаєте нам таку інформацію, ми можемо збирати загальнодоступну\n        інформацію з вебсайтів соціальних мереж, які ви вказали. Ви можете контролювати, скільки\n        вашої інформації вебсайти соціальних мереж оприлюднюють, відвідавши ці вебсайти та змінивши\n        конфіденційність.",
    "text6": "Ми можемо надавати інформацію, яку збираємо, як особисту, так і неособисту, третім особам,\n        таким як рекламодавці, спонсори конкурсів, рекламні та маркетингові партнери та інші, чиї\n        продукти чи послуги, на нашу думку, можуть Вас зацікавити. Ми також можемо ділитися нею з\n        нашими поточними та майбутніми афілійованими компаніями та діловими партнерами, і якщо ми\n        беремо участь у злитті, продажу активів або іншій реорганізації бізнесу, ми також можемо\n        ділитися або передавати Вашу особисту та неособисту інформацію нашим правонаступникам. Ми\n        можемо залучати довірених сторонніх постачальників послуг для виконання функцій і надання\n        нам послуг, таких як розміщення та підтримка наших серверів і додатку, зберігання та\n        керування базами даних, керування електронною поштою, маркетинг зберігання. Ймовірно, ми\n        надамо Вашу особисту інформацію та, можливо, деяку неособисту інформацію цим третім особам,\n        щоб вони могли надавати ці послуги для нас і для Вас. Ми можемо ділитися частинами даних\n        нашого журналу, включаючи IP-адреси, для цілей аналітики третім сторонам, такими як партнери\n        з вебаналітики, розробники додатків і рекламні мережі. Якщо Ваша IP-адреса спільна, вона\n        може використовуватися для оцінки загального розташування та інших технічних даних, таких як\n        швидкість з’єднання, чи відвідували Ви додаток у спільному місці та тип пристрою, який\n        використовується для відвідування додатка. Вони можуть збирати інформацію про те, що Ви\n        бачите у додатку, а потім надавати аудит, дослідження та звітність для нас і наших\n        рекламодавців. Ми також можемо розкривати особисту та неособисту інформацію про Вас\n        представникам державних чи правоохоронних органів або приватним особам, якщо ми, на власний\n        розсуд, вважаємо це необхідним або доречним для відповіді на претензії, судовий процес\n        (включаючи повістки до суду), щоб захистити наші права та інтереси або інтереси третьої\n        сторони, безпеку громадськості чи будь-якої особи, щоб запобігти або припинити будь-яку\n        незаконну, неетичну чи юридичну діяльність або іншим чином виконувати відповідні судові\n        розпорядження, закони, правила та положення.",
    "text7": "iStrong збиратиме особисту інформацію, яку Ви нам надсилаєте. Ми також можемо отримувати\n        особисту інформацію про Вас від третіх осіб, як описано вище.",
    "text8": "Надсилаючи свою адресу електронної пошти у цьому додатку, Ви погоджуєтесь отримувати\n        електронні листи від нас. Ви можете скасувати свою участь у будь-якому з цих списків\n        розсилки в будь-який час, натиснувши посилання для відмови або іншу опцію скасування\n        підписки, яка міститься у відповідному електронному листі. Ми надсилаємо електронні листи\n        лише тим людям, які дозволили нам зв’язуватися з ними безпосередньо чи через третю сторону.\n        Ми не надсилаємо небажаних комерційних електронних листів, тому що ненавидимо спам, так само\n        як і Ви. Надсилаючи свою адресу електронної пошти, Ви також погоджуєтеся використовувати\n        Вашу адресу електронної пошти для націлювання на аудиторію клієнтів на таких сайтах, як\n        Facebook, де ми показуємо спеціальну рекламу конкретним людям, які погодилися отримувати від\n        нас повідомлення. Адреси електронної пошти, надіслані лише на сторінці обробки замовлення,\n        використовуватимуться виключно з метою надсилання вам інформації та оновлень, що стосуються\n        Вашого замовлення. Однак якщо Ви надали нам ту саму електронну адресу іншим способом, ми\n        можемо використовувати її для будь-якої з цілей, зазначених у цій Політиці. Примітка. Якщо в\n        будь-який момент ви захочете скасувати підписку на отримання електронних листів у\n        майбутньому, ми додаємо детальні інструкції щодо скасування підписки внизу кожного\n        електронного листа.",
    "text9": "Ми зберігаємо Вашу інформацію лише до тих пір, поки вона нам потрібна для надання Вам\n        iStrong і досягнення цілей, описаних у цій політиці. Це також стосується всіх, кому ми\n        надаємо вашу інформацію та хто надає послуги від нашого імені. Коли нам більше не потрібно\n        буде використовувати вашу інформацію та зберігати її для дотримання наших юридичних або\n        нормативних зобов’язань, ми або видалимо її з наших систем, або знеособимо, щоб ми не могли\n        ідентифікувати Вас. Зберігання Вашої інформації після припинення використання Вами додатку\n        триватиме пів року.",
    "text10": "Ми застосовуємо низку заходів безпеки, щоб забезпечити безпеку Вашої особистої інформації,\n        коли Ви використовуєте наш додаток. Однак ми не можемо гарантувати абсолютну безпеку\n        будь-якої інформації, яку Ви передаєте iStrong, або гарантувати, що Ваша інформація на\n        Сервісі не може бути доступна, розголошена, змінена чи знищена через порушення будь-якої\n        нашої фізичної, технічної чи управлінської гарантії.",
    "text11": "iStrong зареєстрована в Україні. Інформація, зібрана через наш додаток, через пряму\n        взаємодію з Вами або в результаті використання наших довідкових служб, може час від часу\n        передаватись третім сторонам, розташованим у всьому світі, і може переглядатися та\n        розміщуватися будь-де в світі, включаючи країни, які можуть не мати законів загального\n        застосування, що регулюють використання та передачу таких даних. У повному обсязі,\n        дозволеному чинним законодавством, використовуючи будь-що з вищезазначеного, Ви добровільно\n        погоджуєтеся на транскордонну передачу та розміщення такої інформації.",
    "text12": "Ми вживаємо заходів для захисту Вашої інформації. У нас є фізичні, електронні та\n        управлінські процедури, які допомагають захистити, запобігти несанкціонованому доступу,\n        підтримувати безпеку даних і правильно використовувати Вашу інформацію. Однак ані люди, ані\n        системи безпеки не є надійними, включаючи системи шифрування. Крім того, люди можуть\n        скоювати навмисні злочини, робити помилки або не виконувати політику. Таким чином, хоча ми\n        докладаємо розумних зусиль для захисту вашої особистої інформації, ми не можемо гарантувати\n        її абсолютну безпеку. Якщо застосовне законодавство накладає обов’язок щодо захисту Вашої\n        особистої інформації, який не підлягає запереченню, Ви погоджуєтеся, що навмисне порушення\n        буде стандартом, який використовується для вимірювання дотримання цим обов’язком.",
    "text13": "Ваші права вимагати оновлення або виправлення інформації, яку iStrong збирає, залежать від\n        Ваших відносин із iStrong. Персонал може оновлювати або виправляти свою інформацію, як\n        зазначено у внутрішніх правилах працевлаштування нашої компанії. Ви маєте право вимагати\n        обмеження певного використання та розкриття особистої інформації, як зазначено нижче. Ви\n        можете зв’язатися з нами, щоб (1) оновити або виправити Вашу особисту інформацію, (2)\n        змінити свої налаштування щодо повідомлень та іншої інформації, яку Ви отримуєте від нас,\n        або (3) видалити особисту інформацію, яка зберігається про Вас у нашій системі (з\n        урахуванням наступного абзацу), скасувавши свій обліковий запис. Такі оновлення,\n        виправлення, зміни та видалення не впливатимуть на іншу інформацію, яку ми зберігаємо, або\n        інформацію, яку ми надали третім особам відповідно до цієї Політики конфіденційності до\n        такого оновлення, виправлення, зміни чи видалення. Щоб захистити Вашу конфіденційність і\n        безпеку, ми можемо вжити розумних заходів (наприклад, запросити унікальний пароль), щоб\n        підтвердити вашу особу, перш ніж надавати Вам доступ до профілю або вносити виправлення. Ви\n        несете відповідальність за збереження в таємниці свого унікального пароля та інформації\n        облікового запису в будь-який час. Ви повинні знати, що технологічно неможливо видалити з\n        нашої системи кожен запис інформації, яку Ви надали нам. Необхідність резервного копіювання\n        наших систем для захисту інформації від ненавмисної втрати означає, що копія вашої\n        інформації може існувати в нестираємій формі, яку нам буде важко або неможливо знайти.\n        Негайно після отримання вашого запиту вся особиста інформація, що зберігається в базах\n        даних, які ми активно використовуємо, та в інших медіафайлах, доступних для пошуку, буде\n        оновлена, виправлена, змінена або видалена, залежно від обставин, якомога швидше та в\n        обсязі, який є розумно та технічно можливим. Якщо Ви є кінцевим користувачем і бажаєте\n        оновити, видалити або отримати будь-яку інформацію, яку ми маємо про Вас, Ви можете зробити\n        це, звернувшись до служби підтримки iStrong.",
    "text14": "Ця Політика конфіденційності регулюється законодавством України без урахування колізійного\n        права. Ви погоджуєтеся на виключну юрисдикцію судів у зв’язку з будь-якими діями чи\n        суперечками, що виникають між сторонами відповідно до цієї Політики конфіденційності або у\n        зв’язку з нею. Закони України, за винятком колізійних норм, регулюють цю Угоду та\n        використання Вами додатку. Використання вами програми також може регулюватися іншими\n        місцевими, державними, національними чи міжнародними законами. Ви підтверджуєте, що\n        погоджуєтеся із Політикою конфіденційності та Договором із кінцевим споживачем шляхом\n        проставлення відмітки у спеціальному полі при реєстрації у додатку iStrong. Якщо Ви не\n        згодні з цією Політикою конфіденційності, Вам не слід працювати з нашим застосунком.\n        Продовження використання застосунку, безпосередня взаємодія з нами або публікація змін до\n        цієї Політики конфіденційності, які суттєво не впливають на використання чи розкриття Вашої\n        особистої інформації, означатимуть, що Ви приймаєте ці зміни.",
    "text15": "Ця Політика конфіденційності стосується лише використання нашого додатка. iStrong. Додаток\n        може містити посилання на інші вебсайти, якими не керує iStrong. Ми не несемо\n        відповідальності за зміст, точність або думки, висловлені на таких вебсайтах, і такі\n        вебсайти не досліджуються, не контролюються та не перевіряються на точність або повноту.\n        Будь ласка, пам’ятайте, що коли Ви використовуєте посилання для переходу з Послуг на інший\n        вебсайт, наша Політика конфіденційності більше не діє. Ваш перегляд і взаємодія на\n        будь-якому іншому вебсайті, включно з тими, які мають посилання на нашій платформі,\n        регулюється власними правилами та політикою цього вебсайту. Такі треті сторони можуть\n        використовувати власні файли cookie або інші методи для збору інформації про вас.",
    "text16": "Цей додаток може містити рекламу третіх сторін і посилання на сторонні сайти. iStrong не\n        робить жодних заяв щодо точності чи придатності будь-якої інформації, що міститься в цих\n        рекламних оголошеннях або на сайтах, і не бере на себе жодної відповідальності за поведінку\n        чи зміст цих рекламних оголошень і сайтів, а також пропозицій, зроблених третіми сторонами.\n        Реклама третіх сторін і посилання на інші сайти, де рекламуються товари або послуги, не є\n        підтримкою або рекомендацією iStrong щодо сайтів, товарів або послуг третіх сторін. iStrong\n        не несе відповідальності за зміст будь-якої реклами, дані обіцянки або якість/надійність\n        продуктів чи послуг, які пропонуються в усіх рекламах."
  },
  "noInternet": "Немає підключення до Інтернету.",
  "connectionRestored": "З'єднання відновлено!",
  "shame": "Сором",
  "disgust": "Відраза",
  "tension": "Напруження",
  "perplexity": "Розгубленість",
  "sadness": "Сум",
  "fatigue": "Втома",
  "fear": "Страх",
  "malice": "Злість",
  "solitude": "Самотність",
  "fault": "Провина",
  "concern": "Хвилювання",
  "hope": "Надія",
  "pleasure": "Задоволення",
  "appreciation": "Вдячність",
  "rest": "Спокій",
  "surprise": "Здивування",
  "joy": "Радість",
  "happiness": "Щастя",
  "emotions": {
    "bad": "Не дуже",
    "fine": "Чудово",
    "normal": "Нормально",
    "awful": "Зле"
  },
  "emotions_chart": {
    "no_data_title": "Здається, ти не відзначав свій настрій протягом цього періоду.",
    "no_data_subtitle": "Аби отримати статистику тобі потрібно відзначити свій настрій принаймні раз на день."
  },
  "statistics": {
    "title": "Статистика",
    "advice_title": "Порада",
    "advice_text": "Записуй у щоденнику що викликало у тебе ті чи інші почуття, щоб аналізувати причини та наслідки і почувати себе краще."
  },
  "periods": {
    "day": "Сьогодні",
    "week": "Тиждень",
    "month": "Місяць",
    "custom_one": "1 день",
    "custom_many": "Дні: {{count}}"
  },
  "learningDetails": {
    "what_is_it": "Що таке {{comicName}}?",
    "what_it_gives": "Що дає {{comicName}}?",
    "tips": "Поради від Капібари",
    "remember": "Пам'ятки"
  }
}

